In [10]:
import numpy as np
import pandas as pd
df = pd.DataFrame()
df
df['Name'] = ['Alireza']
df

      Name
0  Alireza

In [12]:
df_new = df
df_new

      Name
0  Alireza

In [14]:
df_new['Name'] = 'Evelin'
display(df_new)
display(df)

     Name
0  Evelin

     Name
0  Evelin